In [1]:
%run helper/setup_notebook.ipynb import display_table

Successfully connected to leetcode50 database.

In [2]:
display_table('Teacher')

+------------+------------+---------+
| teacher_id | subject_id | dept_id |
+------------+------------+---------+
|     1      |     2      |    3    |
|     1      |     2      |    4    |
|     1      |     3      |    3    |
|     2      |     1      |    1    |
|     2      |     2      |    1    |
|     2      |     3      |    1    |
|     2      |     4      |    1    |
+------------+------------+---------+

### Write an SQL query to report the number of unique subjects each teacher teaches in the university.

```
+------------+-----+
| teacher_id | cnt |
+------------+-----+
| 1          | 2   |
| 2          | 4   |
+------------+-----+
Explanation: 
Teacher 1:
  - They teach subject 2 in departments 3 and 4.
  - They teach subject 3 in department 3.
Teacher 2:
  - They teach subject 1 in department 1.
  - They teach subject 2 in department 1.
  - They teach subject 3 in department 1.
  - They teach subject 4 in department 1.
  ```

In [3]:
%%sql 

SELECT 
    teacher_id, 
    COUNT(DISTINCT subject_id) AS cnt 
FROM Teacher 
GROUP BY teacher_id;

[(1, 2), (2, 4)]

# Using Pandas

In [4]:
import pandas as pd

In [5]:
teacher_query = %sql SELECT * FROM Teacher # type: ignore 
teacher_df = teacher_query.DataFrame()
display(teacher_df)

   teacher_id  subject_id  dept_id
0           1           2        3
1           1           2        4
2           1           3        3
3           2           1        1
4           2           2        1
5           2           3        1
6           2           4        1

In [6]:
teacher_df.groupby('teacher_id').agg({'subject_id': 'count'})

            subject_id
teacher_id
1                    3
2                    4

In [7]:
teacher_df.groupby('teacher_id')['subject_id'].nunique()

teacher_id
1    2
2    4
Name: subject_id, dtype: int64

### To filter unique values of a specific column after a `groupby` operation, we cna use the `nunique()` method, which returns the count of unique values in the column - as opposed to `unique()` method, which returns the unique values themselves. 

```py
unique_values = df.groupby('group_column')['column_name'].unique().reset_index()
```

In [8]:
teacher_df = teacher_df.groupby('teacher_id')['subject_id'].nunique().reset_index()
teacher_df

   teacher_id  subject_id
0           1           2
1           2           4

In [9]:
teacher_df = teacher_df.rename(columns={'subject_id': 'cnt'})
teacher_df

   teacher_id  cnt
0           1    2
1           2    4